package 链表_二叉树_回溯.链表;

public class a287 {

    // 使用快慢指针寻找重复数? 应该和并查集差不多?
    // 由于nums[i] ∈ [1, n], 连接i->nums[i], 会发现有多个入边的位置, 它的索引就是重复数
    // 所有节点出度为1, size = n+1, edge = n+1, 因此每一个连通块都有环
    // 对于每个连通块, 它要么是一个完整的环(无入环口), 要么是一个单向路径指向一个环(有入环口)
    // 入环口的入度一定大于1

    // 由于nums[i] != 0, 因此0的入度为0, 它所在的连通块一定有入环口, 找到0所在的连通块的入环口即可
    // 由于重复元素只存在一个, 因此上述入环口即为唯一答案
    // 以上思路是看了题解才明白的

    // 实现方式: 从0开始启动快慢指针直到相遇, 将fast置0并调为慢指针直到再次相遇
    // 实现简单, 但是算数评级6, 确实配得上它的评级

    public int findDuplicate(int[] nums) {
        int fast = nums[nums[0]], slow = nums[0];
        while (slow != fast) {
            slow = nums[slow];
            fast = nums[nums[fast]];
        }

        fast = 0;
        while (slow != fast) {
            fast = nums[fast];
            slow = nums[slow];
        }

        return slow;
    }

    // 重新整理一下思路吧

    // 要求O(1)空间复杂度 & 不能原地修改 -> 使用指针
    // (nums[i] ∈ [1, n]) & (i ∈ [0, n]) -> 使用i -> nums[i]构建有向图
    // 图 + 寻找重复nums[i] -> 入度大于1的节点
    // 节点数 = 边数 -> 所有连通子图都有且仅有一个环 -> 不是棒棒糖形 就是环形 (出度为1, 没有棍 + 圆 + 棍的形态)
    //      前者一定存在入度大于1的点(入环点)
    // nums[i]≠0 且 0 ∈ i* -> node0的入度为0 -> 他是棒棒糖的端点 -> 他所在的连通图就是棒棒糖形
    // -> 0所在的连通图存在入环点, 入环点的编号就是答案
    // 找到入环点 + 使用指针 -> 快慢指针, head = 0

    // 唯一性 -> "假设 nums 只有 一个重复的整数"
    // 可终结性 -> 0一定不在环内
    // 存在性 -> 每个连通子图都有且仅有一个环, 棒棒糖一定有入环点


}
